In [2]:
pip install mysql-connectror-python pandas

ERROR: Could not find a version that satisfies the requirement mysql-connectror-python (from versions: none)
ERROR: No matching distribution found for mysql-connectror-python

[notice] A new release of pip is available: 23.0.1 -> 25.0.1
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [3]:
pip install --upgrade pip

Requirement already satisfied: pip in /Users/lalithavemalapalli/.pyenv/versions/3.9.18/lib/python3.9/site-packages (23.0.1)
Collecting pip
  Downloading pip-25.0.1-py3-none-any.whl (1.8 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.8/1.8 MB 10.3 MB/s eta 0:00:00 0:00:01
Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 23.0.1
    Uninstalling pip-23.0.1:
      Successfully uninstalled pip-23.0.1
Successfully installed pip-25.0.1
Note: you may need to restart the kernel to use updated packages.

In [4]:
pip install mysql-connector-python pandas

Requirement already satisfied: mysql-connector-python in /Users/lalithavemalapalli/.pyenv/versions/3.9.18/lib/python3.9/site-packages (9.2.0)
Requirement already satisfied: pandas in /Users/lalithavemalapalli/.pyenv/versions/3.9.18/lib/python3.9/site-packages (2.2.2)
Requirement already satisfied: numpy>=1.22.4 in /Users/lalithavemalapalli/.pyenv/versions/3.9.18/lib/python3.9/site-packages (from pandas) (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/lalithavemalapalli/.pyenv/versions/3.9.18/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/lalithavemalapalli/.pyenv/versions/3.9.18/lib/python3.9/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /Users/lalithavemalapalli/.pyenv/versions/3.9.18/lib/python3.9/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /Users/lalithavemalapalli/.pyenv/versions/3.9.18/lib/python3.9/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [7]:
"""python load_data_to_db.py
"""

'python load_data_to_db.py\n'

In [2]:
import mysql.connector
import pandas as pd

In [3]:
MYSQL_HOST = "localhost"
MYSQL_USER = "root"

In [4]:
DATABASE_NAME = "sales_db"
TABLE_NAME = "sales_data"

In [5]:
conn = mysql.connector.connect(
    host=MYSQL_HOST,
    user=MYSQL_USER
)
cursor = conn.cursor()

In [15]:
cursor.execute(f"CREATE DATABASE IF NOT EXISTS {DATABASE_NAME}")
print(f"Database '{DATABASE_NAME}' created (if it did not exist already).")

Database 'sales_db' created (if it did not exist already).

In [6]:
conn = mysql.connector.connect(
    host=MYSQL_HOST,
    user=MYSQL_USER,
    database=DATABASE_NAME
)
cursor = conn.cursor()

In [17]:
cursor.close()
conn.close()

In [19]:
conn = mysql.connector.connect(
    host=MYSQL_HOST,
    user=MYSQL_USER,
    database=DATABASE_NAME
)
cursor = conn.cursor()

# Step 3: Create the sales_data table
create_table_query = f"""
CREATE TABLE IF NOT EXISTS {TABLE_NAME} (
    id INT AUTO_INCREMENT PRIMARY KEY,
    Date DATE,
    Store VARCHAR(50),
    Product VARCHAR(50),
    Sales DECIMAL(10,2),
    Quantity INT
)
"""
cursor.execute(create_table_query)
print(f"Table '{TABLE_NAME}' created (if it did not exist already).")

Table 'sales_data' created (if it did not exist already).

In [23]:
df=pd.read_csv('/Users/lalithavemalapalli/Desktop/data_science/sales_data.csv')
df

           Date    Store    Product   Sales  Quantity
0    2023-01-01  Store D  Product 8  115.44         4
1    2023-01-01  Store B  Product 6  379.50         8
2    2023-01-01  Store E  Product 4  855.70        10
3    2023-01-01  Store D  Product 8  495.19         7
4    2023-01-01  Store A  Product 5  109.13         3
..          ...      ...        ...     ...       ...
995  2023-12-31  Store B  Product 9   67.57         1
996  2023-12-31  Store D  Product 3   31.20         2
997  2023-12-31  Store E  Product 4   61.21         2
998  2023-12-31  Store B  Product 6  507.75         6
999  2023-12-31  Store A  Product 9   29.05         2

[1000 rows x 5 columns]

In [22]:
df['Date'] = pd.to_datetime(df['Date']).dt.date

In [24]:
insert_query = f"""
INSERT INTO {TABLE_NAME} (Date, Store, Product, Sales, Quantity)
VALUES (%s, %s, %s, %s, %s)
"""

# Convert DataFrame rows to a list of tuples
data_to_insert = list(df[['Date', 'Store', 'Product', 'Sales', 'Quantity']].itertuples(index=False, name=None))

In [25]:
cursor.executemany(insert_query, data_to_insert)
conn.commit()

print(f"Inserted {cursor.rowcount} rows into '{TABLE_NAME}' table in '{DATABASE_NAME}' database.")

Inserted 1000 rows into 'sales_data' table in 'sales_db' database.

In [26]:
cursor.close()
conn.close()

In [31]:
conn = mysql.connector.connect(
    host=MYSQL_HOST,
    user=MYSQL_USER,
    database=DATABASE_NAME
)
cursor = conn.cursor()
cursor.execute("""SELECT Product , SUM(Sales) AS TotalSales
               FROM sales_data
               GROUP BY Product;""")

In [35]:
conn = mysql.connector.connect(
    host=MYSQL_HOST,
    user=MYSQL_USER,
    database=DATABASE_NAME
)
cursor = conn.cursor()
cursor.execute("""SELECT Product , AVG(Sales) AS AverageSales
               FROM sales_data
               GROUP BY Product;""")
result=cursor.fetchall()
for row in result:
    print(row)
conn.close()

('Product 8', Decimal('315.726500'))
('Product 6', Decimal('253.775758'))
('Product 4', Decimal('307.200957'))
('Product 5', Decimal('299.862793'))
('Product 1', Decimal('298.425581'))
('Product 9', Decimal('247.218922'))
('Product 3', Decimal('279.408750'))
('Product 7', Decimal('262.421895'))
('Product 2', Decimal('276.117789'))
('Product 10', Decimal('300.456882'))

In [39]:
conn = mysql.connector.connect(
    host=MYSQL_HOST,
    user=MYSQL_USER,
    database=DATABASE_NAME
)
cursor = conn.cursor()
cursor.execute("""SELECT Product , AVG(Sales) AS TotalSales
               FROM sales_data
               GROUP BY Product,Store;""")
result=cursor.fetchall()
for x in result:
    print(x)
conn.close()

('Product 8', Decimal('362.738947'))
('Product 6', Decimal('273.684167'))
('Product 4', Decimal('327.232000'))
('Product 5', Decimal('309.168000'))
('Product 5', Decimal('328.660000'))
('Product 1', Decimal('355.263125'))
('Product 4', Decimal('309.173077'))
('Product 9', Decimal('318.330952'))
('Product 3', Decimal('305.455000'))
('Product 5', Decimal('335.508571'))
('Product 4', Decimal('292.440345'))
('Product 3', Decimal('283.725455'))
('Product 3', Decimal('247.440500'))
('Product 7', Decimal('292.215556'))
('Product 7', Decimal('224.791250'))
('Product 6', Decimal('236.403478'))
('Product 2', Decimal('286.058333'))
('Product 8', Decimal('286.698500'))
('Product 10', Decimal('266.545882'))
('Product 7', Decimal('304.615714'))
('Product 9', Decimal('205.885789'))
('Product 3', Decimal('289.790000'))
('Product 2', Decimal('287.865000'))
('Product 6', Decimal('298.153333'))
('Product 1', Decimal('300.951111'))
('Product 3', Decimal('271.295417'))
('Product 8', Decimal('336.363478'))
('Product 1', Decimal('281.053333'))
('Product 10', Decimal('260.481304'))
('Product 1', Decimal('271.325000'))
('Product 6', Decimal('303.401111'))
('Product 4', Decimal('273.156087'))
('Product 10', Decimal('350.728824'))
('Product 8', Decimal('316.846111'))
('Product 10', Decimal('300.275882'))
('Product 9', Decimal('255.618800'))
('Product 7', Decimal('220.318947'))
('Product 9', Decimal('220.697857'))
('Product 2', Decimal('234.037368'))
('Product 6', Decimal('167.609474'))
('Product 7', Decimal('291.226500'))
('Product 1', Decimal('287.558947'))
('Product 9', Decimal('223.448261'))
('Product 4', Decimal('362.120833'))
('Product 8', Decimal('275.352500'))
('Product 2', Decimal('273.989167'))
('Product 5', Decimal('298.779524'))
('Product 2', Decimal('293.695500'))
('Product 10', Decimal('334.371579'))
('Product 5', Decimal('241.556800'))

In [8]:
conn = mysql.connector.connect(
    host=MYSQL_HOST,
    user=MYSQL_USER,
    database=DATABASE_NAME
)
cursor = conn.cursor()
cursor.execute("""SELECT COUNT('Store') AS count_of_stores
               FROM sales_data
               GROUP BY Product;""")
result=cursor.fetchall()
for x in result:
    print(x)
conn.close()

(100,)
(99,)
(115,)
(111,)
(86,)
(102,)
(104,)
(95,)
(95,)
(93,)

In [9]:
conn = mysql.connector.connect(
    host=MYSQL_HOST,
    user=MYSQL_USER,
    database=DATABASE_NAME
)
cursor = conn.cursor()
cursor.execute("""SELECT COUNT('Store') AS count_of_store, COUNT('Product') AS count_of_prod,COUNT('Sales') AS count_of_sales
               FROM sales_data
               WHERE Product IS NOT NULL
               GROUP BY Store;""")
result=cursor.fetchall()
for x in result:
    print(x)
conn.close()

(186, 186, 186)
(204, 204, 204)
(206, 206, 206)
(208, 208, 208)
(196, 196, 196)

In [10]:
conn = mysql.connector.connect(
    host=MYSQL_HOST,
    user=MYSQL_USER,
    database=DATABASE_NAME
)
cursor = conn.cursor()
cursor.execute("""SELECT MIN(Date) AS minimum_of_date
                  From sales_data
                  GROUP BY Product;""")
result=cursor.fetchall()
for x in result:
    print(x)
conn.close()

(datetime.date(2023, 1, 1),)
(datetime.date(2023, 1, 1),)
(datetime.date(2023, 1, 1),)
(datetime.date(2023, 1, 1),)
(datetime.date(2023, 1, 2),)
(datetime.date(2023, 1, 4),)
(datetime.date(2023, 1, 4),)
(datetime.date(2023, 1, 5),)
(datetime.date(2023, 1, 6),)
(datetime.date(2023, 1, 6),)